Repository: hovsep0699/ricky_morty
Catalog: lib/l10n/intl_*.arb
Languages: ru

# appName
source: Ricky and Morty
ru: Рик и Морти

# nullResponseMessage
source: Response is null
ru: Ответ отсутствует

# validationErrorMessage
source: Validation error
ru: Ошибка валидации

# permissionErrorMessage
source: Permission denied
ru: Доступ запрещён

# resourceErrorMessage
source: Resource was not found or does not exist
ru: Ресурс не найден или не существует

# requestAccessErrorMessage
source: No Access to perform the request
ru: Нет доступа для выполнения запроса

# invalidRequestErrorMessage
source: Invalid Request
ru: Неверный запрос

# serverSideErrorMessage
source: Request failed due to server-side
ru: Запрос не выполнен из-за ошибки на сервере

# serverCommunicationErrorMessage
source: Error while communicating to the server
ru: Ошибка при соединении с сервером

# incorrectCredentialsErrorMessage
source: Incorrect credentials
ru: Неверные учетные данные

# conflictErrorMessage
source: Conflict error
ru: Ошибка конфликта

# unknownErrorMessage
source: Unknown Error
ru: Неизвестная ошибка

# responseFailedErrorMessage
source: Response failed with status code {statusCode}: {message}
ru: Ошибка ответа с кодом {statusCode}: {message}
